# WoodDiffusePerlinEnable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodDiffusePerlinEnable Property
AdvancedWood Class See Also
---
The property labeled "Use perlin function for diffuse albedo" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodDiffusePerlinEnable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodDiffusePerlinEnable As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodDiffusePerlinEnable {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace